backend: tensorflow
class_name: Sequential
config:
  build_input_shape: !!python/object/apply:tensorflow.python.framework.tensor_shape.TensorShape
  - - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - null
    - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - 56
    - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
      - 11776
  layers:
  - class_name: Dense
    config:
      activation: softsign
      activity_regularizer:
        class_name: L1L2
        config:
          l1: 0.0010000000474974513
          l2: 0.0010000000474974513
      batch_input_shape: !!python/tuple
      - null
      - 56
      - 11776
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_6
      trainable: true
      units: 1
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_4
      noise_shape: null
      rate: 0.125
      seed: null
      trainable: true
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: RNN
        config:
          cell:
            class_name: PeepholeLSTMCell
            config:
              activation: softsign
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dropout: 0.125
              dtype: float32
              implementation: 1
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: peephole_lstm_cell_4
              recurrent_activation: hard_sigmoid
              recurrent_constraint: null
              recurrent_dropout: 0.0
              recurrent_initializer:
                class_name: Orthogonal
                config:
                  gain: 1.0
                  seed: null
              recurrent_regularizer: null
              trainable: true
              unit_forget_bias: true
              units: 1
              use_bias: true
          dtype: float32
          go_backwards: false
          name: rnn_4
          return_sequences: false
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unroll: false
      merge_mode: concat
      name: bidirectional_4
      trainable: true
  - class_name: RepeatVector
    config:
      dtype: float32
      n: 28
      name: repeat_vector_4
      trainable: true
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: RNN
        config:
          cell:
            class_name: PeepholeLSTMCell
            config:
              activation: softsign
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dropout: 0.125
              dtype: float32
              implementation: 1
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: peephole_lstm_cell_5
              recurrent_activation: hard_sigmoid
              recurrent_constraint: null
              recurrent_dropout: 0.0
              recurrent_initializer:
                class_name: Orthogonal
                config:
                  gain: 1.0
                  seed: null
              recurrent_regularizer: null
              trainable: true
              unit_forget_bias: true
              units: 1
              use_bias: true
          dtype: float32
          go_backwards: false
          name: rnn_5
          return_sequences: false
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unroll: false
      merge_mode: concat
      name: bidirectional_5
      trainable: true
  - class_name: RepeatVector
    config:
      dtype: float32
      n: 28
      name: repeat_vector_5
      trainable: true
  - class_name: Dense
    config:
      activation: softsign
      activity_regularizer:
        class_name: L1L2
        config:
          l1: 0.0010000000474974513
          l2: 0.0010000000474974513
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_7
      trainable: true
      units: 1
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_5
      noise_shape: null
      rate: 0.125
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_8
      trainable: true
      units: 11776
      use_bias: true
  name: sequential_2
keras_version: 2.3.0-tf
